#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```terraform
aws_iam_policy.deploy_site: Refreshing state... [id=arn:aws:iam::659077917555:policy/HomepageDeploymentPolicy]
aws_iam_policy.deployment: Refreshing state... [id=arn:aws:iam::659077917555:policy/HomepageApiDeploymentPolicy]
aws_acm_certificate.api_cert: Refreshing state... [id=arn:aws:acm:us-west-2:659077917555:certificate/ea9e3f63-d6ff-4971-b5d2-eafd528116ab]
aws_apigatewayv2_api.homepage_api: Refreshing state... [id=lf1d3vv0e4]
aws_dynamodb_table.visitor_counter: Refreshing state... [id=homepage-visitor-table]
aws_iam_role.frontend_deploy: Refreshing state... [id=gh-oidc]
aws_iam_role.api_gw_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch-logs-role]
aws_iam_role.lambda_exec: Refreshing state... [id=lambda-default-execution-role]
aws_iam_role.backend_deploy: Refreshing state... [id=homepage-backend-deploy-gha-oidc]
aws_cloudwatch_log_group.api_access_logs: Refreshing state... [id=/aws/apigateway/homepage/access-logs]
aws_apigatewayv2_domain_name.api_domain_name: Refreshing state... [id=api.seanmeenaghan.com]
aws_lambda_function.visitor_api: Refreshing state... [id=visitor-api]
aws_apigatewayv2_api_mapping.api_mapping: Refreshing state... [id=h3qh8k]
aws_iam_role_policy_attachment.backend_deploy: Refreshing state... [id=homepage-backend-deploy-gha-oidc/arn:aws:iam::659077917555:policy/HomepageApiDeploymentPolicy]
aws_iam_role_policy_attachment.api_gw_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch-logs-role/arn:aws:iam::aws:policy/service-role/AmazonAPIGatewayPushToCloudWatchLogs]
aws_iam_role_policy_attachment.frontend_deploy: Refreshing state... [id=gh-oidc/arn:aws:iam::659077917555:policy/HomepageDeploymentPolicy]
aws_iam_role_policy_attachment.lambda_basic_exec: Refreshing state... [id=lambda-default-execution-role/arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
aws_iam_role_policy.dynamodb_access: Refreshing state... [id=lambda-default-execution-role:homepage-visitor-dynamodb-access]
aws_apigatewayv2_integration.get_visitor: Refreshing state... [id=4rerk2u]
aws_apigatewayv2_integration.post_visitor: Refreshing state... [id=xw86kto]
aws_apigatewayv2_route.post_visitor: Refreshing state... [id=1sjst7h]
aws_apigatewayv2_route.get_visitor: Refreshing state... [id=on8wzih]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # aws_api_gateway_account.main will be created
  + resource "aws_api_gateway_account" "main" {
      + api_key_version     = (known after apply)
      + cloudwatch_role_arn = "arn:aws:iam::659077917555:role/api-gateway-cloudwatch-logs-role"
      + features            = (known after apply)
      + id                  = (known after apply)
      + region              = "us-west-2"
      + throttle_settings   = (known after apply)
    }

  # aws_iam_policy.deployment will be updated in-place
  ~ resource "aws_iam_policy" "deployment" {
        id               = "arn:aws:iam::659077917555:policy/HomepageApiDeploymentPolicy"
        name             = "HomepageApiDeploymentPolicy"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                    # (3 unchanged elements hidden)
                    {
                        Action   = [
                            "apigateway:GET",
                            "apigateway:POST",
                            "apigateway:PUT",
                            "apigateway:PATCH",
                            "apigateway:DELETE",
                            "apigateway:UpdateRestApiPolicy",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                        Sid      = "APIGatewayPermissions"
                    },
                  ~ {
                      ~ Action   = [
                            # (9 unchanged elements hidden)
                            "iam:ListAttachedRolePolicies",
                          - "iam:TagRole",
                          - "iam:UntagRole",
                            "iam:ListInstanceProfilesForRole",
                          - "iam:UntagPolicy",
                            "iam:ListRoleTags",
                          + "iam:TagRole",
                          + "iam:UntagRole",
                            "iam:ListPolicyTags",
                            "iam:TagPolicy",
                          + "iam:UntagPolicy",
                        ]
                        # (3 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Resource  = [
                            "arn:aws:iam::659077917555:role/lambda-default-execution-role",
                          + "arn:aws:iam::659077917555:role/api-gateway-cloudwatch-logs-role",
                        ]
                        # (4 unchanged attributes hidden)
                    },
                    {
                        Action   = [
                            "iam:CreatePolicy",
                            "iam:DeletePolicy",
                            "iam:GetPolicy",
                            "iam:GetPolicyVersion",
                            "iam:ListPolicyVersions",
                            "iam:CreatePolicyVersion",
                            "iam:DeletePolicyVersion",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:iam::659077917555:policy/*",
                        ]
                        Sid      = "IAMPolicyPermissions"
                    },
                  ~ {
                      ~ Action   = [
                          + "logs:ListTagsForResource",
                            "logs:CreateLogGroup",
                            # (7 unchanged elements hidden)
                        ]
                        # (3 unchanged attributes hidden)
                    },
                    {
                        Action   = [
                            "route53:ChangeResourceRecordSets",
                            "route53:ListHostedZones",
                            "route53:ListResourceRecordSets",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                        Sid      = "Route53"
                    },
                    # (3 unchanged elements hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {}
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

```

</details>

*Pusher: @s-meenaghan7, Action: `pull_request`, Workflow: `Terraform Deploy`*